{
    "info": {
        "name": "Dwarf",
        "author": {
            "@url": "http://dnd.wizards.com/products/tabletop-games/rpg-products/rpg_playershandbook",
            "#text": "Wizards of the Coast"
        },
        "update": {
            "@version": "0.2.8",
            "file": {
                "@name": "race-dwarf.xml",
                "@url": "https://raw.githubusercontent.com/aurorabuilder/elements/master/core/players-handbook/races/race-dwarf.xml"
            }
        }
    },
    "element": [
        {
            "@name": "Dwarf",
            "@type": "Race",
            "@source": "Player’s Handbook",
            "@id": "ID_SRD_RACE_DWARF",
            "description": {
                "p": [
                    "Kingdoms rich in ancient grandeur, halls carved into the roots of mountains, the echoing of picks and hammers in deep mines and blazing forges, a commitment to clan and tradition, and a burning hatred of goblins and orcs—these common threads unite all dwarves.",
                    "Bold and hardy, dwarves are known as skilled warriors, miners, and workers of stone and metal. Though they stand well under 5 feet tall, dwarves are so broad and compact that they can weigh as much as a human standing nearly two feet taller. Their courage and endurance are also easily a match for any of the larger folk.",
                    "Dwarven skin ranges from deep brown to a paler hue tinged with red, but the most common shades are light brown or deep tan, like certain tones of earth. Their hair, worn long but in simple styles, is usually black, gray, or brown, though paler dwarves often have red hair. Male dwarves value their beards highly and groom them carefully.",
                    "Dwarves can live to be more than 400 years old, so the oldest living dwarves often remember a very different world. For example, some of the oldest dwarves living in Citadel Felbarr (in the world of the Forgotten Realms) can recall the day, more than three centuries ago, when orcs conquered the fortress and drove them into an exile that lasted over 250 years. This longevity grants them a perspective on the world that shorter-lived races such as humans and halflings lack.",
                    "Dwarves are solid and enduring like the mountains they love, weathering the passage of centuries with stoic endurance and little change. They respect the traditions of their clans, tracing their ancestry back to the founding of their most ancient strongholds in the youth of the world, and don't abandon those traditions lightly. Part of those traditions is devotion to the gods of the dwarves, who uphold the dwarven ideals of industrious labor, skill in battle, and devotion to the forge.",
                    "Individual dwarves are determined and loyal, true to their word and decisive in action, sometimes to the point of stubbornness. Many dwarves have a strong sense of justice, and they are slow to forget wrongs they have suffered. A wrong done to one dwarf is a wrong done to the dwarf’s entire clan, so what begins as one dwarf’s hunt for vengeance can become a full-blown clan feud.",
                    "Dwarven kingdoms stretch deep beneath the mountains where the dwarves mine gems and precious metals and forge items of wonder. They love the beauty and artistry of precious metals and fine jewelry, and in some dwarves this love festers into avarice. Whatever wealth they can’t find in their mountains, they gain through trade. They dislike boats, so enterprising humans and halflings frequently handle trade in dwarven goods along water routes. Trustworthy members of other races are welcome in dwarf settlements, though some areas are off limits even to them.",
                    "The chief unit of dwarven society is the clan, and dwarves highly value social standing. Even dwarves who live far from their own kingdoms cherish their clan identities and affiliations, recognize related dwarves, and invoke their ancestors’ names in oaths and curses. To be clanless is the worst fate that can befall a dwarf.",
                    "Dwarves in other lands are typically artisans, especially weaponsmiths, armorers, and jewelers. Some become mercenaries or bodyguards, highly sought after for their courage and loyalty.",
                    "Dwarves who take up the adventuring life might be motivated by a desire for treasure—for its own sake, for a specific purpose, or even out of an altruistic desire to help others. Other dwarves are driven by the command or inspiration of a deity, a direct calling or simply a desire to bring glory to one of the dwarf gods. Clan and ancestry are also important motivators. A dwarf might seek to restore a clan’s lost honor, avenge an ancient wrong the clan suffered, or earn a new place within the clan after having been exiled. Or a dwarf might search for the axe wielded by a mighty ancestor, lost on the field of battle centuries ago.",
                    "A dwarf’s name is granted by a clan elder, in accordance with tradition. Every proper dwarven name has been used and reused down through the generations. A dwarf’s name belongs to the clan, not to the individual. A dwarf who misuses or brings shame to a clan name is stripped of the name and forbidden by law to use any dwarven name in its place.",
                    "Your dwarf character has an assortment of inborn abilities, part and parcel of dwarven nature.",
                    {
                        "strong": {
                            "em": "Ability Score Increase."
                        },
                        "#text": "Your Constitution score increases by 2."
                    },
                    {
                        "strong": {
                            "em": "Age."
                        },
                        "#text": "Dwarves mature at the same rate as humans, but they’re considered young until they reach the age of 50. On average, they live about 350 years."
                    },
                    {
                        "strong": {
                            "em": "Alignment."
                        },
                        "#text": "Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order."
                    },
                    {
                        "strong": {
                            "em": "Size."
                        },
                        "#text": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium."
                    },
                    {
                        "strong": {
                            "em": "Speed."
                        },
                        "#text": "Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor."
                    },
                    {
                        "strong": {
                            "em": "Darkvision."
                        },
                        "#text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
                    },
                    {
                        "strong": {
                            "em": "Dwarven Resilience."
                        },
                        "#text": "You have advantage on saving throws against poison, and you have resistance against poison damage (explained in chapter 9)."
                    },
                    {
                        "strong": {
                            "em": "Dwarven Combat Training."
                        },
                        "#text": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
                    },
                    {
                        "strong": {
                            "em": "Tool Proficiency."
                        },
                        "#text": "You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools."
                    },
                    {
                        "strong": {
                            "em": "Stonecunning."
                        },
                        "#text": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
                    },
                    {
                        "strong": {
                            "em": "Languages."
                        },
                        "#text": "You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
                    },
                    {
                        "strong": {
                            "em": "Subrace."
                        },
                        "#text": "Two main subraces of dwarves populate the worlds of D&D: hill dwarves and mountain dwarves. Choose one of these subraces."
                    }
                ],
                "h4": [
                    "SHORT AND STOUT",
                    "LONG MEMORY, LONG GRUDGES",
                    "CLANS AND KINGDOMS",
                    "GODS, GOLD, AND CLANS",
                    "DWARF NAMES",
                    "DWARF TRAITS"
                ],
                "ul": [
                    {
                        "strong": "Male Names:",
                        "#text": "Adrik, Alberich, Baern, Barendd, Brottor, Bruenor, Dain, Darrak, Delg, Eberk, Einkil, Fargrim, Flint, Gardain, Harbek, Kildrak, Morgran, Orsik, Oskar, Rangrim, Rurik, Taklinn, Thoradin, Thorin, Tordek, Traubon, Travok, Ulfgar, Veit, Vondal"
                    },
                    {
                        "strong": "Female Names:",
                        "#text": "Amber, Artin, Audhild, Bardryn, Dagnal, Diesa, Eldeth, Falkrunn, Finellen, Gunnloda, Gurdis, Helja, Hlin, Kathra, Kristryd, Ilde, Liftrasa, Mardred, Riswynn, Sannl, Torbera, Torgga, Vistra"
                    },
                    {
                        "strong": "Clan Names:",
                        "#text": "Balderk, Battlehammer, Brawnanvil, Dankil, Fireforge, Frostbeard, Gorunn, Holderhek, Ironfist, Loderr, Lutgehr, Rumnaheim, Strakeln, Torunn, Ungart"
                    }
                ]
            },
            "sheet": {
                "@display": "false"
            },
            "setters": [
                {
                    "@name": "names",
                    "@type": "male",
                    "#text": "Adrik, Alberich, Baern, Barendd, Brottor, Bruenor, Dain, Darrak, Delg, Eberk, Einkil, Fargrim, Flint, Gardain, Harbek, Kildrak, Morgran, Orsik, Oskar, Rangrim, Rurik, Taklinn, Thoradin, Thorin, Tordek, Traubon, Travok, Ulfgar, Veit, Vondal"
                },
                {
                    "@name": "names",
                    "@type": "female",
                    "#text": "Amber, Artin, Audhild, Bardryn, Dagnal, Diesa, Eldeth, Falkrunn, Finellen, Gunnloda, Gurdis, Helja, Hlin, Kathra, Kristryd, Ilde, Liftrasa, Mardred, Riswynn, Sannl, Torbera, Torgga, Vistra"
                },
                {
                    "@name": "names",
                    "@type": "clan",
                    "#text": "Balderk, Battlehammer, Brawnanvil, Dankil, Fireforge, Frostbeard, Gorunn, Holderhek, Ironfist, Loderr, Lutgehr, Rumnaheim, Strakeln, Torunn, Ungart"
                },
                {
                    "@name": "names-format",
                    "#text": "{{name}} {{clan}}"
                }
            ],
            "rules": {
                "stat": [
                    {
                        "@name": "constitution",
                        "@value": "2"
                    },
                    {
                        "@name": "innate speed",
                        "@value": "25",
                        "@bonus": "base"
                    }
                ],
                "grant": [
                    {
                        "@type": "Size",
                        "@id": "ID_SIZE_MEDIUM"
                    },
                    {
                        "@type": "Vision",
                        "@id": "ID_VISION_DARKVISION"
                    },
                    {
                        "@type": "Language",
                        "@id": "ID_LANGUAGE_COMMON"
                    },
                    {
                        "@type": "Language",
                        "@id": "ID_LANGUAGE_DWARVISH"
                    },
                    {
                        "@type": "Racial Trait",
                        "@id": "ID_RACIAL_TRAIT_DWARVEN_RESILIENCE"
                    },
                    {
                        "@type": "Racial Trait",
                        "@id": "ID_RACIAL_TRAIT_DWARVEN_COMBAT_TRAINING",
                        "@requirements": "!ID_WOTC_PSK_SUBRACE_KALADESH_DWARF"
                    },
                    {
                        "@type": "Racial Trait",
                        "@id": "ID_RACIAL_TRAIT_DWARVEN_TOOL_PROFICIENCY",
                        "@requirements": "!ID_WOTC_PSK_SUBRACE_KALADESH_DWARF"
                    },
                    {
                        "@type": "Racial Trait",
                        "@id": "ID_RACIAL_TRAIT_STONECUNNING",
                        "@requirements": "!ID_WOTC_PSK_SUBRACE_KALADESH_DWARF"
                    },
                    {
                        "@type": "Racial Trait",
                        "@id": "ID_RACIAL_TRAIT_DWARVEN_SUBRACE"
                    }
                ]
            }
        },
        {
            "@name": "Dwarven Resilience",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_DWARVEN_RESILIENCE",
            "description": {
                "p": "You have advantage on saving throws against poison, and you have resistance against poison damage."
            },
            "sheet": {
                "description": "You have advantage on saving throws against poison, and you have resistance against poison damage."
            },
            "rules": {
                "grant": {
                    "@type": "Condition",
                    "@id": "ID_INTERNAL_CONDITION_DAMAGE_RESISTANCE_POISON"
                }
            }
        },
        {
            "@name": "Dwarven Combat Training",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_DWARVEN_COMBAT_TRAINING",
            "description": {
                "p": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
            },
            "sheet": {
                "@display": "false",
                "description": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
            },
            "rules": [
                {
                    "@type": "Proficiency",
                    "@id": "ID_PROFICIENCY_WEAPON_PROFICIENCY_BATTLEAXE"
                },
                {
                    "@type": "Proficiency",
                    "@id": "ID_PROFICIENCY_WEAPON_PROFICIENCY_HANDAXE"
                },
                {
                    "@type": "Proficiency",
                    "@id": "ID_PROFICIENCY_WEAPON_PROFICIENCY_LIGHT_HAMMER"
                },
                {
                    "@type": "Proficiency",
                    "@id": "ID_PROFICIENCY_WEAPON_PROFICIENCY_WARHAMMER"
                }
            ]
        },
        {
            "@name": "Tool Proficiency",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_DWARVEN_TOOL_PROFICIENCY",
            "description": {
                "p": "You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools."
            },
            "sheet": {
                "@display": "false"
            },
            "rules": {
                "select": {
                    "@type": "Proficiency",
                    "@name": "Dwarven Tool Proficiency",
                    "@supports": "ID_PROFICIENCY_TOOL_PROFICIENCY_SMITHS_TOOLS|ID_PROFICIENCY_TOOL_PROFICIENCY_BREWERS_SUPPLIES|ID_PROFICIENCY_TOOL_PROFICIENCY_MASONS_TOOLS"
                }
            }
        },
        {
            "@name": "Stonecunning",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_STONECUNNING",
            "description": {
                "p": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
            },
            "sheet": {
                "description": "A +{{stonecunning:check}} on History checks related to origin of stonework."
            },
            "rules": [
                {
                    "@name": "stonecunning:check",
                    "@value": "intelligence:modifier"
                },
                {
                    "@name": "stonecunning:check",
                    "@value": "history:misc"
                },
                {
                    "@name": "stonecunning:check",
                    "@value": "proficiency"
                },
                {
                    "@name": "stonecunning:check",
                    "@value": "proficiency"
                }
            ]
        },
        {
            "@name": "Dwarven Subrace",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_DWARVEN_SUBRACE",
            "description": {
                "p": "Two main subraces of dwarves populate the worlds of D&D: hill dwarves and mountain dwarves. Choose one of these subraces."
            },
            "sheet": {
                "@display": "false"
            },
            "rules": {
                "select": {
                    "@type": "Sub Race",
                    "@name": "Dwarven Subrace",
                    "@supports": "Dwarf"
                }
            }
        },
        {
            "@name": "Hill Dwarf",
            "@type": "Sub Race",
            "@source": "Player’s Handbook",
            "@id": "ID_SUB_RACE_HILL_DWARF",
            "supports": "Dwarf",
            "description": [
                "As a hill dwarf, you have keen senses, deep intuition, and remarkable resilience. The gold dwarves of Faerûn in their mighty southern kingdom are hill dwarves, as are the exiled Neidar and the debased Klar of Krynn in the Dragonlance setting.",
                {
                    "strong": {
                        "em": "Ability Score Increase."
                    },
                    "#text": "Your Wisdom score increases by 1."
                },
                {
                    "strong": {
                        "em": "Dwarven Toughness."
                    },
                    "#text": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
                }
            ],
            "sheet": {
                "@display": "false"
            },
            "setters": [
                {
                    "@name": "height",
                    "@modifier": "2d4",
                    "#text": "3'8\""
                },
                {
                    "@name": "weight",
                    "@modifier": "2d6",
                    "#text": "115 lb."
                }
            ],
            "rules": {
                "stat": {
                    "@name": "wisdom",
                    "@value": "1"
                },
                "grant": {
                    "@type": "Racial Trait",
                    "@id": "ID_RACIAL_TRAIT_DWARVEN_TOUGHNESS"
                }
            }
        },
        {
            "@name": "Dwarven Toughness",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_DWARVEN_TOUGHNESS",
            "description": {
                "p": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
            },
            "sheet": {
                "@display": "false",
                "description": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
            },
            "rules": {
                "stat": {
                    "@name": "hp",
                    "@value": "level"
                }
            }
        },
        {
            "@name": "Mountain Dwarf",
            "@type": "Sub Race",
            "@source": "Player’s Handbook",
            "@id": "ID_SUB_RACE_MOUNTAIN_DWARF",
            "supports": "Dwarf",
            "description": [
                "As a mountain dwarf, you're strong and hardy, accustomed to a difficult life in rugged terrain. You’re probably on the tall side (for a dwarf), and tend toward lighter coloration. The shield dwarves of northern Faerûn, as well as the ruling Hylar clan and the noble Daewar clan of Dragonlance, are mountain dwarves.",
                {
                    "strong": {
                        "em": "Ability Score Increase."
                    },
                    "#text": "Your Strength score increases by 2."
                },
                {
                    "strong": {
                        "em": "Dwarven Armor Training."
                    },
                    "#text": "You have proficiency with light and medium armor."
                }
            ],
            "sheet": {
                "@display": "false"
            },
            "setters": [
                {
                    "@name": "height",
                    "@modifier": "2d4",
                    "#text": "4'"
                },
                {
                    "@name": "weight",
                    "@modifier": "2d6",
                    "#text": "130 lb."
                }
            ],
            "rules": {
                "stat": {
                    "@name": "strength",
                    "@value": "2"
                },
                "grant": {
                    "@type": "Racial Trait",
                    "@id": "ID_RACIAL_TRAIT_DWARVEN_ARMOR_TRAINING"
                }
            }
        },
        {
            "@name": "Dwarven Armor Training",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_DWARVEN_ARMOR_TRAINING",
            "description": {
                "p": "You have proficiency with light and medium armor."
            },
            "sheet": {
                "@display": "false",
                "description": "You have proficiency with light and medium armor."
            },
            "rules": [
                {
                    "@type": "Proficiency",
                    "@id": "ID_PROFICIENCY_ARMOR_PROFICIENCY_LIGHT_ARMOR"
                },
                {
                    "@type": "Proficiency",
                    "@id": "ID_PROFICIENCY_ARMOR_PROFICIENCY_MEDIUM_ARMOR"
                }
            ]
        }
    ]
}