{
    "info": {
        "name": "Half-Orc",
        "update": {
            "@version": "0.2",
            "file": {
                "@name": "race-halforc.xml",
                "@url": "https://raw.githubusercontent.com/aurorabuilder/elements/master/core/players-handbook/races/race-halforc.xml"
            }
        }
    },
    "element": [
        {
            "@name": "Half-Orc",
            "@type": "Race",
            "@source": "Player’s Handbook",
            "@id": "ID_RACE_HALFORC",
            "description": {
                "p": [
                    "Whether united under the leadership of a mighty warlock or having fought to a standstill after years of conflict, orc and human tribes sometimes form alliances, joining forces into a larger horde to the terror of civilized lands nearby. When these alliances are sealed by marriages, half-orcs are born. Some half-orcs rise to become proud chiefs of orc tribes, their human blood giving them an edge over their full-blooded orc rivals. Some venture into the world to prove their worth among humans and other more civilized races. Many of these become adventurers, achieving greatness for their mighty deeds and notoriety for their barbaric customs and savage fury.",
                    "Half-orcs’ grayish pigmentation, sloping foreheads, jutting jaws, prominent teeth, and towering builds make their orcish heritage plain for all to see. Half-orcs stand between 6 and 7 feet tall and usually weigh between 180 and 250 pounds.",
                    "Orcs regard battle scars as tokens of pride and ornamental scars as things of beauty. Other scars, though, mark an orc or half-orc as a former slave or a disgraced exile. Any half-orc who has lived among or near orcs has scars, whether they are marks of humiliation or of pride, recounting their past exploits and injuries. Such a half-orc living among humans might display these scars proudly or hide them in shame.",
                    "The one-eyed god Gruumsh created the orc s, and even those orcs who turn away from his worship can’t fully escape his influence. The same is true of half-orcs, though their human blood moderates the impact of their orcish heritage. Some half-orcs hear the whispers of Gruumsh in their dreams, calling them to unleash the rage that simmers within them. Others feel Gruumsh’s exultation when they join in melee combat—and either exult along with him or shiver with fear and loathing. Half-orcs are not evil by nature, but evil does lurk within them, whether they embrace it or rebel against it.",
                    "Beyond the rage of Gruumsh, half-orcs feel emotion powerfully. Rage doesn’t just quicken their pulse, it makes their bodies burn. An insult stings like acid, and sadness saps their strength. But they laugh loudly and heartily, and simple bodily pleasures—feasting, drinking, wrestling, drumming, and wild dancing—fill their hearts with joy. They tend to be short-tempered and sometimes sullen, more inclined to action than contemplation and to fighting than arguing. The most accomplished half-orcs are those with enough selfcontrol to get by in a civilized land.",
                    "Half-orcs most often live among orc s. Of the other races, humans are most likely to accept half-orcs, and halforcs almost always live in human lands when not living among orc tribes. Whether proving themselves among rough barbarian tribes or scrabbling to survive in the slums of larger cities, half-orcs get by on their physical might, their endurance, and the sheer determination they inherit from their human ancestry.",
                    "Half-orcs usually have names appropriate to the culture in which they were raised. A half-orc who wants to fit in among humans might trade an orc name for a human name. Some half-orcs with human names decide to adopt a guttural orc name because they think it makes them more intimidating.",
                    "Your half-orc character has certain traits deriving from your orc ancestry.",
                    {
                        "strong": {
                            "em": "Ability Score Increase."
                        },
                        "#text": "Your Strength score increases by 2, and your Constitution score increases by 1."
                    },
                    {
                        "strong": {
                            "em": "Age."
                        },
                        "#text": "Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years."
                    },
                    {
                        "strong": {
                            "em": "Alignment."
                        },
                        "#text": "Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil."
                    },
                    {
                        "strong": {
                            "em": "Size."
                        },
                        "#text": "Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium."
                    },
                    {
                        "strong": {
                            "em": "Speed."
                        },
                        "#text": "Your base walking speed is 30 feet."
                    },
                    {
                        "strong": {
                            "em": "Darkvision."
                        },
                        "#text": "Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
                    },
                    {
                        "strong": {
                            "em": "Menacing."
                        },
                        "#text": "You gain proficiency in the Intimidation skill."
                    },
                    {
                        "strong": {
                            "em": "Relentless Endurance."
                        },
                        "#text": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."
                    },
                    {
                        "strong": {
                            "em": "Savage Attacks."
                        },
                        "#text": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit."
                    },
                    {
                        "strong": {
                            "em": "Languages."
                        },
                        "#text": "You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script."
                    }
                ],
                "h4": [
                    "SCARRED AND STRONG",
                    "THE MARK OF GRUUMSH",
                    "TRIBES AND SLUMS",
                    "HALF-ORC NAMES",
                    "HALF-ORC TRAITS"
                ],
                "ul": [
                    {
                        "strong": "Male Orc Names:",
                        "#text": "Dench, Feng, Gell, Henk, Holg, Imsh, Keth, Krusk, Mhurren, Ront, Shump, Thokk"
                    },
                    {
                        "strong": "Female Orc Names:",
                        "#text": "Baggi, Emen, Engong, Kansif, Myev, Neega, Ovak, Ownka, Shautha, Sutha, Vola, Volen, Yevelda"
                    }
                ]
            },
            "sheet": {
                "@display": "false"
            },
            "setters": [
                {
                    "@name": "names",
                    "@type": "male",
                    "#text": "Dench, Feng, Gell, Henk, Holg, Imsh, Keth, Krusk, Mhurren, Ront, Shump, Thokk"
                },
                {
                    "@name": "names",
                    "@type": "female",
                    "#text": "Baggi, Emen, Engong, Kansif, Myev, Neega, Ovak, Ownka, Shautha, Sutha, Vola, Volen, Yevelda"
                },
                {
                    "@name": "names-format",
                    "#text": "{{name}}"
                },
                {
                    "@name": "height",
                    "@modifier": "2d10",
                    "#text": "4'10\""
                },
                {
                    "@name": "weight",
                    "@modifier": "2d6",
                    "#text": "140 lb."
                }
            ],
            "rules": {
                "stat": [
                    {
                        "@name": "strength",
                        "@value": "2",
                        "@requirements": "!ID_WOTC_WGTE_GRANTS_DARKMARKED,!ID_INTERNAL_GRANTS_DRAGONMARK"
                    },
                    {
                        "@name": "constitution",
                        "@value": "1",
                        "@requirements": "!ID_WOTC_WGTE_GRANTS_DARKMARKED,!ID_INTERNAL_GRANTS_DRAGONMARK"
                    },
                    {
                        "@name": "innate speed",
                        "@value": "30",
                        "@bonus": "base"
                    }
                ],
                "grant": [
                    {
                        "@type": "Size",
                        "@id": "ID_SIZE_MEDIUM"
                    },
                    {
                        "@type": "Vision",
                        "@id": "ID_VISION_DARKVISION",
                        "@requirements": "!ID_INTERNAL_GRANTS_DRAGONMARK"
                    },
                    {
                        "@type": "Racial Trait",
                        "@id": "ID_RACIAL_TRAIT_MENACING",
                        "@requirements": "!ID_WOTC_WGTE_GRANTS_DARKMARKED,!ID_INTERNAL_GRANTS_DRAGONMARK"
                    },
                    {
                        "@type": "Racial Trait",
                        "@id": "ID_RACIAL_TRAIT_RELENTLESS_ENDURANCE",
                        "@requirements": "!ID_WOTC_WGTE_GRANTS_DARKMARKED,!ID_INTERNAL_GRANTS_DRAGONMARK"
                    },
                    {
                        "@type": "Racial Trait",
                        "@id": "ID_RACIAL_TRAIT_SAVAGE_ATTACKS",
                        "@requirements": "!ID_WOTC_WGTE_GRANTS_DARKMARKED,!ID_INTERNAL_GRANTS_DRAGONMARK"
                    },
                    {
                        "@type": "Language",
                        "@id": "ID_LANGUAGE_COMMON"
                    },
                    {
                        "@type": "Language",
                        "@id": "ID_LANGUAGE_ORC",
                        "@requirements": "!ID_INTERNAL_GRANTS_DRAGONMARK"
                    }
                ],
                "select": {
                    "@type": "Race Variant",
                    "@name": "Half-Orc Variant",
                    "@supports": "Half-Orc Variant",
                    "@optional": "true"
                }
            }
        },
        {
            "@name": "Menacing",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_MENACING",
            "description": {
                "p": "You gain proficiency in the Intimidation skill."
            },
            "sheet": {
                "@display": "false",
                "description": "You gain proficiency in the Intimidation skill."
            },
            "rules": {
                "grant": {
                    "@type": "Proficiency",
                    "@id": "ID_PROFICIENCY_SKILL_INTIMIDATION"
                }
            }
        },
        {
            "@name": "Relentless Endurance",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_RELENTLESS_ENDURANCE",
            "description": {
                "p": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."
            },
            "sheet": {
                "@usage": "1/Long Rest",
                "description": "When you are reduced to 0 hps but not killed outright, you can drop to 1 hp instead."
            }
        },
        {
            "@name": "Savage Attacks",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACIAL_TRAIT_SAVAGE_ATTACKS",
            "description": {
                "p": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit."
            },
            "sheet": {
                "description": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit."
            }
        }
    ]
}