{
    "info": {
        "name": "Human",
        "description": [],
        "author": {
            "@url": "http://dnd.wizards.com/products/tabletop-games/rpg-products/rpg_playershandbook",
            "#text": "Wizards of the Coast"
        },
        "update": {
            "@version": "0.2.7",
            "file": {
                "@name": "race-human.xml",
                "@url": "https://raw.githubusercontent.com/aurorabuilder/elements/master/core/players-handbook/races/race-human.xml"
            }
        }
    },
    "element": [
        {
            "@name": "Human",
            "@type": "Race",
            "@source": "Player’s Handbook",
            "@id": "ID_RACE_HUMAN",
            "description": {
                "p": [
                    "In the reckonings of most worlds, humans are the youngest of the common races, late to arrive on the world scene and short-lived in comparison to dwarves, elves, and dragons. Perhaps it is because of their shorter lives that they strive to achieve as much as they can in the years they are given. Or maybe they feel they have something to prove to the elder races, and that’s why they build their mighty empires on the foundation of conquest and trade. Whatever drives them, humans are the innovators, the achievers, and the pioneers of the worlds.",
                    "With their penchant for migration and conquest, humans are more physically diverse than other common races. There is no typical human. An individual can stand from 5 feet to a little over 6 feet tall and weigh from 125 to 250 pounds. Human skin shades range from nearly black to very pale, and hair colors from black to blond (curly, kinky, or straight); males might sport facial hair that is sparse or thick. A lot of humans have a dash of nonhuman blood, revealing hints of elf, orc, or other lineages. Humans reach adulthood in their late teens and rarely live even a single century.",
                    "Humans are the most adaptable and ambitious people among the common races. They have widely varying tastes, morals, and customs in the many different lands where they have settled. When they settle, though, they stay: they build cities to last for the ages, and great kingdoms that can persist for long centuries. An individual human might have a relatively short life span, but a human nation or culture preserves traditions with origins far beyond the reach of any single human’s memory. They live fully in the present—making them well suited to the adventuring life—but also plan for the future, striving to leave a lasting legacy. Individually and as a group, humans are adaptable opportunists, and they stay alert to changing political and social dynamics.",
                    "Where a single elf or dwarf might take on the responsibility of guarding a special location or a powerful secret, humans found sacred orders and institutions for such purposes. While dwarf clans and halfling elders pass on the ancient traditions to each new generation, human temples, governments, libraries, and codes of law fix their traditions in the bedrock of history. Humans dream of immortality, but (except for those few who seek undeath or divine ascension to escape death’s clutches) they achieve it by ensuring that they will be remembered when they are gone.",
                    "Although some humans can be xenophobic, in general their societies are inclusive. Human lands welcome large numbers of nonhumans compared to the proportion of humans who live in nonhuman lands.",
                    "Humans who seek adventure are the most daring and ambitious members of a daring and ambitious race. They seek to earn glory in the eyes of their fellows by amassing power, wealth, and fame. More than other people, humans champion causes rather than territories or groups.",
                    "Having so much more variety than other cultures, humans as a whole have no typical names. Some human parents give their children names from other languages, such as Dwarvish or Elvish (pronounced more or less correctly), but most parents give names that are linked to their region’s culture or to the naming traditions of their ancestors.",
                    "The material culture and physical characteristics of humans can change wildly from region to region. In the Forgotten Realms, for example, the clothing, architecture, cuisine, music, and literature are different in the northwestern lands of the Silver Marches than in distant Turmish or Impiltur to the east—and even more distinctive in far-off Kara-Tur. Human physical characteristics, though, vary according to the ancient migrations of the earliest humans, so that the humans of the Silver Marches have every possible variation of coloration and features.",
                    "In the Forgotten Realms, nine human ethnic groups are widely recognized, though over a dozen others are found in more localized areas of Faerûn. These groups, and the typical names of their members, can be used as inspiration no matter which world your human is in.",
                    "Shorter and slighter in build than most other humans, Calishites have dusky brown skin, hair, and eyes. They’re found primarily in southwest Faerûn.",
                    {
                        "span": "Calishite Names:",
                        "#text": "(Male) Aseir, Bardeid, Haseid, Khemed, Mehmen, Sudeiman, Zasheir; (female) Atala, Ceidil, Hama, Jasmal, Meilil, Seipora, Yasheira, Zasheida; (surnames) Basha, Dumein, Jassan, Khalid, Mostana, Pashar, Rein"
                    },
                    "Chondathans are slender, tawny-skinned folk with brown hair that ranges from almost blond to almost black. Most are tall and have green or brown eyes, but these traits are hardly universal. Humans of Chondathan descent dominate the central lands of Faerûn. around the Inner Sea.",
                    {
                        "span": "Chondathan Names:",
                        "#text": "(Male) Darvin, Dorn, Evendur, Gorstag, Grim, Helm, Malark, Morn, Randal, Stedd; (female) Arveene, Esvele, Jhessail, Kerri, Lureene, Miri, Rowan, Shandri, Tessele; (surnames) Amblecrown, Buckman, Dundragon, Evenwood, Greycastle, Tallstag"
                    },
                    "Found primarily in the northwest of Faerûn, Damarans are of moderate height and build, with skin hues ranging from tawny to fair. Their hair is usually brown or black, and their eye color varies widely, though brown is most common.",
                    {
                        "span": "Damaran Names:",
                        "#text": "(Male) Bor, Fodel, Glar, Grigor, Igan, Ivor, Kosef, Mival, Orel, Pavel, Sergor; (female) Alethra, Kara, Katernin, Mara, Natali, Olma, Tana, Zora; (surnames) Bersk, Chernin, Dotsk, Kulenov, Marsk, Nemetsk, Shemov, Starag"
                    },
                    "Illuskans are tall, fair-skinned folk with blue or steely gray eyes. Most have raven-black hair, but those who inhabit the extreme northwest have blond, red, or light brown hair.",
                    {
                        "span": "Illuskan Names:",
                        "#text": "(Male) Ander, Blath, Bran, Frath, Geth, Lander, Luth, Malcer, Stor, Taman, Urth; (female) Amafrey, Betha, Cefrey, Kethra, Mara, Olga, Silifrey, Westra; (surnames) Brightwood, Helder, Hornraven, Lackman, Stormwind, Windrivver"
                    },
                    "Dominant in the eastern and southeastern shores of the Inner Sea, the Mulan are generally tall, slim, and amber-skinned, with eyes of hazel or brown. Their hair ranges from black to dark brown, but in the lands where the Mulan are most prominent, nobles and many other Mulan shave off all their hair.",
                    {
                        "span": "Mulan Names:",
                        "#text": "(Male) Aoth, Bareris, Ehput-Ki, Kethoth, Mumed, Ramas, So-Kehur, Thazar-De, Urhur; (female) Arizima, Chathi, Nephis, Nulara, Murithi, Sefris, Thola, Umara, Zolis; (surnames) Ankhalab, Anskuld, Fezim, Hahpet, Nathandem, Sepret, Uuthrakt"
                    },
                    "Most often found east of the Inner Sea and often intermingled with the Mulan, Rashemis tend to be short, stout, and muscular. They usually have dusky skin, dark eyes, and thick black hair.",
                    {
                        "span": "Rashemi Names:",
                        "#text": "(Male) Borivik, Faurgar, Jandar, Kanithar, Madislak, Ralmevik, Shaumar, Vladislak; (female) Fyevarra, Hulmarra, Immith, Imzel, Navarra, Shevarra, Tammith. Yuldra; (surnames) Chergoba, Dyernina, Iltazyara, Murnyethara, Stayanoga, Ulmokina"
                    },
                    "The Shou are the most numerous and powerful ethnic group in Kara-Tur, far to the east of Faerûn. They are yellowish-bronze in hue, with black hair and dark eyes. Shou surnames are usually presented before the given name.",
                    {
                        "span": "Shou Names:",
                        "#text": "(Male) An, Chen, Chi, Fai, Jiang, Jun, Lian, Long, Meng, On, Shan, Shui, Wen; (female) Bai, Chao, Jia, Lei, Mei, Qiao, Shui, Tai; (surnames) Chien, Huang, Kao, Kung, Lao, Ling, Mei, Pin, Shin, Sum, Tan, Wan"
                    },
                    "Widespread along the entire Sword Coast at the western edge of Faerûn, Tethyrians are of medium build and height, with dusky skin that tends to grow fairer the farther north they dwell. Their hair and eye color varies widely, but brown hair and blue eyes are the most common. Tethyrians primarily use Chondathan names.",
                    "Native to the southern shore of the Inner Sea, the Turami people are generally tall and muscular, with dark mahogany skin, curly black hair, and dark eyes.",
                    {
                        "span": "Turami Names:",
                        "#text": "(Male) Anton, Diero, Marcon, Pieron, Rimardo, Romero, Salazar, Umbero; (female) Balama, Dona, Faila, Jalana, Luisa, Marta, Quara, Selise, Vonda; (surnames) Agosto, Astorio, Calabra, Domine, Falone, Marivaldi, Pisacar, Ramondo"
                    },
                    "It’s hard to make generalizations about humans, but your human character has these traits.",
                    {
                        "span": [
                            "Ability Score Increase.",
                            "Age.",
                            "Alignment.",
                            "Size.",
                            "Speed.",
                            "Languages."
                        ],
                        "#text": [
                            "Your ability scores each increase by 1.",
                            "Humans reach adulthood in their late teens and live less than a century.",
                            "Humans tend toward no particular alignment. The best and the worst are found among them.",
                            "Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.",
                            "Your base walking speed is 30 feet.",
                            "You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
                        ],
                        "br": [
                            [],
                            [],
                            [],
                            [],
                            []
                        ]
                    }
                ],
                "h4": [
                    "A BROAD SPECTRUM",
                    "VARIETY IN ALL THINGS",
                    "LASTING INSTITUTIONS",
                    "EXEMPLARS OF AMBITION",
                    "HUMAN NAMES AND ETHNICITIES",
                    "HUMAN TRAITS"
                ],
                "h6": [
                    "Calishite",
                    "Chondathan",
                    "Damaran",
                    "Illuskan",
                    "Mulan",
                    "Rashemi",
                    "Shou",
                    "Tethyrian",
                    "Turami"
                ],
                "div": {
                    "@element": "ID_RACE_VARIANT_HUMAN_VARIANT"
                }
            },
            "sheet": {
                "@display": "false"
            },
            "setters": [
                {
                    "@name": "names",
                    "@type": "male",
                    "#text": "Ander, Blath, Bran, Frath, Geth, Lander, Luth, Malcer, Stor, Taman, Urth"
                },
                {
                    "@name": "names",
                    "@type": "female",
                    "#text": "Amafrey, Betha, Cefrey, Kethra, Mara, Olga, Silifrey, Westra"
                },
                {
                    "@name": "names",
                    "@type": "surname",
                    "#text": "Brightwood, Helder, Hornraven, Lackman, Stormwind, Windrivver"
                },
                {
                    "@name": "names-format",
                    "#text": "{{name}} {{surname}}"
                },
                {
                    "@name": "height",
                    "@modifier": "2d10",
                    "#text": "4'8\""
                },
                {
                    "@name": "weight",
                    "@modifier": "2d4",
                    "#text": "110 lb."
                }
            ],
            "rules": {
                "stat": [
                    {
                        "@name": "strength",
                        "@value": "1",
                        "@requirements": "!(ID_INTERNAL_GRANTS_REQTEMPFIX||ID_RACE_VARIANT_HUMAN_VARIANT||ID_INTERNAL_GRANTS_DRAGONMARK||ID_WOTC_WGTE_GRANTS_DARKMARKED||ID_UA_PS_GRANTS_HUMAN_VARIANT)"
                    },
                    {
                        "@name": "dexterity",
                        "@value": "1",
                        "@requirements": "!(ID_INTERNAL_GRANTS_REQTEMPFIX||ID_RACE_VARIANT_HUMAN_VARIANT||ID_INTERNAL_GRANTS_DRAGONMARK||ID_WOTC_WGTE_GRANTS_DARKMARKED||ID_UA_PS_GRANTS_HUMAN_VARIANT)"
                    },
                    {
                        "@name": "constitution",
                        "@value": "1",
                        "@requirements": "!(ID_INTERNAL_GRANTS_REQTEMPFIX||ID_RACE_VARIANT_HUMAN_VARIANT||ID_INTERNAL_GRANTS_DRAGONMARK||ID_WOTC_WGTE_GRANTS_DARKMARKED||ID_UA_PS_GRANTS_HUMAN_VARIANT)"
                    },
                    {
                        "@name": "intelligence",
                        "@value": "1",
                        "@requirements": "!(ID_INTERNAL_GRANTS_REQTEMPFIX||ID_RACE_VARIANT_HUMAN_VARIANT||ID_INTERNAL_GRANTS_DRAGONMARK||ID_WOTC_WGTE_GRANTS_DARKMARKED||ID_UA_PS_GRANTS_HUMAN_VARIANT)"
                    },
                    {
                        "@name": "wisdom",
                        "@value": "1",
                        "@requirements": "!(ID_INTERNAL_GRANTS_REQTEMPFIX||ID_RACE_VARIANT_HUMAN_VARIANT||ID_INTERNAL_GRANTS_DRAGONMARK||ID_WOTC_WGTE_GRANTS_DARKMARKED||ID_UA_PS_GRANTS_HUMAN_VARIANT)"
                    },
                    {
                        "@name": "charisma",
                        "@value": "1",
                        "@requirements": "!(ID_INTERNAL_GRANTS_REQTEMPFIX||ID_RACE_VARIANT_HUMAN_VARIANT||ID_INTERNAL_GRANTS_DRAGONMARK||ID_WOTC_WGTE_GRANTS_DARKMARKED||ID_UA_PS_GRANTS_HUMAN_VARIANT)"
                    },
                    {
                        "@name": "innate speed",
                        "@value": "30",
                        "@bonus": "base"
                    }
                ],
                "grant": [
                    {
                        "@type": "Size",
                        "@id": "ID_SIZE_MEDIUM"
                    },
                    {
                        "@type": "Language",
                        "@id": "ID_LANGUAGE_COMMON"
                    }
                ],
                "select": [
                    {
                        "@type": "Language",
                        "@name": "Language (Human)",
                        "@supports": "Standard||Exotic",
                        "@requirements": "!ID_UA_PS_GRANTS_HUMAN_VARIANT,!ID_WOTC_ERLW_DRAGONMARK_MARK_OF_FINDING"
                    },
                    {
                        "@type": "Race Variant",
                        "@name": "Human Variant",
                        "@supports": "Human",
                        "@optional": "true"
                    }
                ]
            }
        },
        {
            "@name": "Human Variant",
            "@type": "Race Variant",
            "@source": "Player’s Handbook",
            "@id": "ID_RACE_VARIANT_HUMAN_VARIANT",
            "supports": "Human",
            "requirements": "ID_INTERNAL_OPTION_ALLOW_FEATS",
            "description": [
                "If your campaign uses the optional feat rules from the Player’s Handbook, your Dungeon Master might allow these variant traits, all of which replace the human’s Ability Score Increase trait.",
                {
                    "span": [
                        "Ability Score Increase.",
                        "Skills.",
                        "Feat."
                    ],
                    "#text": [
                        "Two different ability scores of your choice increase by 1.",
                        "You gain proficiency in one skill of your choice.",
                        "You gain one feat of your choice."
                    ],
                    "br": [
                        [],
                        []
                    ]
                }
            ],
            "sheet": {
                "@alt": "Human",
                "@display": "false"
            },
            "rules": [
                {
                    "@type": "Racial Trait",
                    "@name": "Ability Score Increase (Human Variant)",
                    "@supports": "Human Variant",
                    "@number": "2"
                },
                {
                    "@type": "Proficiency",
                    "@name": "Skill Proficiency (Human Variant)",
                    "@supports": "Skill"
                },
                {
                    "@type": "Feat",
                    "@name": "Feat (Human Variant)"
                }
            ]
        },
        {
            "@name": "Req Temp Fix",
            "@type": "Grants",
            "@source": "Internal",
            "@id": "ID_INTERNAL_GRANTS_REQTEMPFIX"
        },
        {
            "@name": "Ability Score Increase (Strength)",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACE_VARIANT_HUMAN_VARIANT_STRENGTH",
            "compendium": {
                "@display": "false"
            },
            "supports": "Human Variant",
            "description": {
                "p": "Your Strength score increases by 1."
            },
            "sheet": {
                "@display": "false"
            },
            "rules": {
                "stat": {
                    "@name": "strength",
                    "@value": "1",
                    "@alt": "Human Variant"
                }
            }
        },
        {
            "@name": "Ability Score Increase (Dexterity)",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACE_VARIANT_HUMAN_VARIANT_DEXTERITY",
            "compendium": {
                "@display": "false"
            },
            "supports": "Human Variant",
            "description": {
                "p": "Your Dexterity score increases by 1."
            },
            "sheet": {
                "@display": "false"
            },
            "rules": {
                "stat": {
                    "@name": "dexterity",
                    "@value": "1",
                    "@alt": "Human Variant"
                }
            }
        },
        {
            "@name": "Ability Score Increase (Constitution)",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACE_VARIANT_HUMAN_VARIANT_CONSTITUTION",
            "compendium": {
                "@display": "false"
            },
            "supports": "Human Variant",
            "description": {
                "p": "Your Constitution score increases by 1."
            },
            "sheet": {
                "@display": "false"
            },
            "rules": {
                "stat": {
                    "@name": "constitution",
                    "@value": "1",
                    "@alt": "Human Variant"
                }
            }
        },
        {
            "@name": "Ability Score Increase (Intelligence)",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACE_VARIANT_HUMAN_VARIANT_INTELLIGENCE",
            "compendium": {
                "@display": "false"
            },
            "supports": "Human Variant",
            "description": {
                "p": "Your Intelligence score increases by 1."
            },
            "sheet": {
                "@display": "false"
            },
            "rules": {
                "stat": {
                    "@name": "intelligence",
                    "@value": "1",
                    "@alt": "Human Variant"
                }
            }
        },
        {
            "@name": "Ability Score Increase (Wisdom)",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACE_VARIANT_HUMAN_VARIANT_WISDOM",
            "compendium": {
                "@display": "false"
            },
            "supports": "Human Variant",
            "description": {
                "p": "Your Wisdom score increases by 1."
            },
            "sheet": {
                "@display": "false"
            },
            "rules": {
                "stat": {
                    "@name": "wisdom",
                    "@value": "1",
                    "@alt": "Human Variant"
                }
            }
        },
        {
            "@name": "Ability Score Increase (Charisma)",
            "@type": "Racial Trait",
            "@source": "Player’s Handbook",
            "@id": "ID_RACE_VARIANT_HUMAN_VARIANT_CHARISMA",
            "compendium": {
                "@display": "false"
            },
            "supports": "Human Variant",
            "description": {
                "p": "Your Charisma score increases by 1."
            },
            "sheet": {
                "@display": "false"
            },
            "rules": {
                "stat": {
                    "@name": "charisma",
                    "@value": "1",
                    "@alt": "Human Variant"
                }
            }
        }
    ],
    "append": {
        "@id": "ID_RACE_VARIANT_HUMAN_VARIANT",
        "rules": {
            "grant": {
                "@type": "Grants",
                "@id": "ID_INTERNAL_GRANTS_REQTEMPFIX"
            }
        }
    }
}